tap "caffix/amass"
tap "derailed/k9s"
tap "filippo.io/age", "https://filippo.io/age"
tap "go-gitea/gitea"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jenkins-x/jx"
tap "jesseduffield/lazygit"
tap "mas-cli/tap"
tap "petere/sgml"
tap "rcmdnk/file"
tap "remotemobprogramming/brew"
tap "theseal/ssh-askpass"
tap "wagoodman/dive"
tap "weaveworks/tap"
tap "weltraumschaf/tap"
# Portable ASCII art graphics library
brew "aalib"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally 🚀
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Asynchronous DNS library
brew "c-ares"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Angular
brew "angular-cli"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Java build tool
brew "ant"
# ANother Tool for Language Recognition
brew "antlr"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# C library for creating IP packets
brew "libnet"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Standard SGML representation system for technical documents
brew "docbook"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Record and share terminal sessions
brew "asciinema"
# Automatically exclude development dependencies from Time Machine backups
brew "asimov"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Low-level library for pixel manipulation
brew "pixman"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Swiss Army Knife for OSGi bundles
brew "bnd"
# New way to see and navigate directory trees
brew "broot"
# Object-file caching compiler wrapper
brew "ccache"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Securely send things from one computer to another
brew "croc"
# C string library for manipulating Unicode strings
brew "libunistring"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Converts boring normal dates to fun Discordian Date
brew "ddate"
# Ncurses based advanced hex editor featuring diff mode and more
brew "dhex"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Ogg Bitstream Library
brew "libogg"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# DOS Emulator
brew "dosbox"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Functional programming language for building browser-based GUIs
brew "elm"
# Charset analyzer and converter
brew "enca"
# AST-based pattern checker for JavaScript
brew "eslint"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Test various flash cards
brew "f3"
# ISO AAC audio decoder
brew "faad2"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Free lossless audio codec
brew "flac"
# Generic library support script
brew "libtool"
# Asynchronous event library
brew "libevent"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Open video compression format
brew "theora"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU debugger
brew "gdb"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Library for USB device access
brew "libusb"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Manage your GnuPG keys with ease! 🔐
brew "gpg-tui"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Kubernetes package manager
brew "helm"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Advanced HTML-to-text converter
brew "html2text"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit"
# Converts many CD-ROM image formats to ISO9660
brew "iat"
# Improved colored diff
brew "icdiff"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Agile dependency manager
brew "ivy"
# Library for creating multi-platform software
brew "s-lang"
# Powerful editor for programmers
brew "jed"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Python implementation written in Java (successor to JPython)
brew "jython"
# LastPass command-line interface tool
brew "lastpass-cli"
# Build tool for Clojure
brew "leiningen"
# Input filter for the pager less
brew "lesspipe"
# Implementation of the file(1) command
brew "libmagic"
# Portable sound library
brew "libmikmod"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# C implementation of a Sass compiler
brew "libsass"
# City simulation game
brew "lincity-ng"
# Library for database change tracking
brew "liquibase"
# Python generator for the console
brew "lorem"
# MPEG audio decoder
brew "mad"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Recursively compute digests on files/directories
brew "md5deep"
# Scalable distributed version control system
brew "mercurial"
# Modern and intuitive terminal-based text editor
brew "micro"
# Run a Kubernetes cluster locally
brew "minikube"
# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Project documentation with Markdown
brew "mkdocs"
# Automated testing for Ansible roles
brew "molecule"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Network authentication cracking tool
brew "ncrack"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# HTTP/DNS scanner configurable via YAML templates
brew "nuclei"
# Manage multiple Node.js versions
brew "nvm"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# General purpose programming language in the ML family
brew "ocaml"
# Generic build tool for OCaml
brew "ocamlbuild"
# Kubernetes introspection tool for developers
brew "octant"
# SGML parser
brew "open-sp"
# OpenShift command-line interface tools
brew "openshift-cli"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Parallel bzip2
brew "pbzip2"
# Simplistic interactive filtering tool
brew "peco"
# Draw UML diagrams
brew "plantuml"
# Emulator for x86 and PowerPC
brew "qemu"
# Tool for managing OCI containers and pods
brew "podman"
# Password generator
brew "pwgen"
# Cross-platform application and UI framework
brew "qt"
# File browser
brew "ranger"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Convert character set (charsets)
brew "recode"
# Web Reconnaissance Framework
brew "recon-ng"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Fast, efficient and secure backup program
brew "restic"
# Utility for computing and verifying hash sums of files
brew "rhash"
# JavaScript engine
brew "rhino"
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup-init"
# Wrapper around libsass that helps to create command-line apps
brew "sassc"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Graphic adventure game interpreter
brew "scummvm"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Count lines of code in many languages
brew "sloccount"
# S/MIME signing utility for use with Git
brew "smimesign"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Editor of encrypted files
brew "sops"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# SSL scanner
brew "sslyze"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# Generate scripting interfaces to C/C++ code
brew "swig"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Linter for Terraform files
brew "tflint"
# Text interface for Git repositories
brew "tig"
# High-performance, platform-neutral implementation of VNC
brew "tiger-vnc"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Simple GTD-style task management for the command-line
brew "ultralist"
# This UML tool aimed at providing a fast way of creating UML diagrams
brew "umlet"
# Bash completion for Vagrant
brew "vagrant-completion"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Bundler for JavaScript and friends
brew "webpack"
# Internet file retriever
brew "wget"
# ISO9660+RR manipulation tool
brew "xorriso"
# JavaScript package manager
brew "yarn"
# Process YAML documents from the CLI
brew "yq"
# In-depth Attack Surface Mapping and Asset Discovery
brew "caffix/amass/amass"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Mac App Store command-line interface
brew "mas-cli/tap/mas"
# Modular DocBook DSSSL stylesheets
brew "petere/sgml/docbook-dsssl"
# Implementation of the DSSSL language
brew "petere/sgml/openjade"
# Swift handover for remote mobs using git. mob is a CLI tool written in GO. It keeps your master branch clean and creates WIP commits on mob-session branch.
brew "remotemobprogramming/brew/mob"
# The ssh-askpass util for MacOS
brew "theseal/ssh-askpass/ssh-askpass"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Sshpass is a tool for non-interactivly performing password authentication with SSH's so called "interactive keyboard password authentication".
# Most user should use SSH's more secure public key authentiaction instead.
brew "weltraumschaf/tap/sshpass"
# Application launcher and productivity software
cask "alfred"
cask "android-sdk"
# Application uninstaller
cask "appcleaner"
# Text editor
cask "atom"
# Desktop password and login vault
cask "bitwarden"
# Web security testing toolkit
cask "burp-suite"
# Clipboard extension app
cask "clipy"
# Tool to enable and disable hidden functions of Finder and other apps
cask "deeper"
# Draw structured diagrams
cask "dia"
# Digital photo manager
cask "digikam"
# App to build and share containerized applications and microservices
cask "docker"
# Draw.io is free online diagram software
cask "drawio"
# Finds duplicate files in a computer system
cask "dupeguru"
# Sci-fi themed terminal emulator and system monitor
cask "edex-ui"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Mind-mapping software written in Java
cask "freemind"
# Desktop client for GitHub repositories
cask "github"
# Open-source video transcoder
cask "handbrake"
# Hex editor focussing on speed
cask "hex-fiend"
# HTTP and GraphQL Client
cask "insomnia"
# Java IDE by JetBrains
cask "intellij-idea"
# Wireless discovery tool
cask "istumbler"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Secure video conferencing app
cask "jitsi-meet"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
cask "keystore-explorer"
# Visual user interface for Docker Container management
cask "kitematic"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Free and open-source painting and sketching program
cask "krita"
# Create, manage and debug system- and user services
cask "launchcontrol"
# Official client for LBRY, a decentralised file-sharing and payment network
cask "lbry"
# Office suite
cask "libreoffice"
# Go IDE
cask "liteide"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Operating system maintenance and cleaning utility
cask "maintenance"
cask "mark-text"
# Penetration testing framework
cask "metasploit"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Online collaborative whiteboard platform
cask "miro"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk"
cask "multifirefox"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Development environment, tooling platform and application framework
cask "netbeans"
# Free and open-source RSS reader
cask "netnewswire"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
cask "obs-virtualcam"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# ZFS driver and utilities
cask "openzfs"
# Free and open source web app scanner
cask "owasp-zap"
# Simple Gtk# Paint Program
cask "pinta"
# Calculate the overall performance of an investment portfolio
cask "portfolioperformance"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Archive manager for data compression and backups
cask "rar"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Scans, detects, and monitors keyboard taps
cask "reikey"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Video chat, voice call and instant messaging application
cask "skype"
# Microsofts instant messaging enterprise software
cask "skype-for-business"
# Team communication and collaboration software
cask "slack"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
# Application for inspecting installer packages
cask "suspicious-package"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# General-purpose text editor
cask "textmate"
# Python IDE for beginners
cask "thonny"
# Customizable email client
cask "thunderbird"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# AMD64/Intel64 and x86 virtualization
cask "virtualbox-extension-pack"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
# Open-source markdown editor
cask "zettlr"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "Annotate", id: 918207447
mas "Caffeinated", id: 1362171212
mas "Cyberduck", id: 409222199
mas "EasyFind", id: 411673888
mas "GIF Brewery 3", id: 1081413713
mas "iMovie", id: 408981434
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Marked", id: 448925439
mas "MeisterTask", id: 1051767777
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode Lite", id: 402397683
mas "OneDrive", id: 823766827
mas "Outbank", id: 1094255754
mas "Pocket", id: 568494494
mas "SimpleMind", id: 439654198
mas "Trello", id: 1278508951
mas "uBlock", id: 1385985095
