tap "caffix/amass"
tap "caskroom/versions"
tap "go-gitea/gitea"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jenkins-x/jx"
tap "jesseduffield/lazygit"
tap "mas-cli/tap"
tap "petere/sgml"
tap "rcmdnk/file"
tap "scyv/jenkins-slave"
tap "wagoodman/dive"
tap "weaveworks/tap"
# Portable ASCII art graphics library
brew "aalib"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr", link: false
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Check binary and source compatibility for C/C++
brew "abi-compliance-checker"
# Search tool like grep, but optimized for programmers
brew "ack"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Angular
brew "angular-cli"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible", link: false
# Java build tool
brew "ant"
# ANother Tool for Language Recognition
brew "antlr"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# C library for creating IP packets
brew "libnet"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Record and share terminal sessions
brew "asciinema"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Google's own build tool
brew "bazel"
# GNU binary tools for native development
brew "binutils", link: true
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# The Swiss Army Knife for OSGi bundles
brew "bnd"
# Asynchronous DNS library
brew "c-ares"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Low-level library for pixel manipulation
brew "pixman"
# Object-file caching compiler wrapper
brew "ccache"
# Compiler for the Scheme programming language
brew "chicken"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# The Clojure Programming Language
brew "clojure"
# Generate code for scanning Z-polyhedra
brew "cloog"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Go dependency management tool
brew "dep"
# Ncurses based advanced hex editor featuring diff mode and more
brew "dhex"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Standard SGML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Docker-compose completion script
brew "docker-compose-completion"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Charset analyzer and converter
brew "enca"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Test various flash cards
brew "f3"
# ISO AAC audio decoder
brew "faad2"
# Easiest way to build and release mobile apps
brew "fastlane"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Asynchronous event library
brew "libevent"
# C string library for manipulating Unicode strings
brew "libunistring"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Open video compression format
brew "theora"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU debugger
brew "gdb"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Distributed revision control system
brew "git"
# GNU multiple precision arithmetic library
brew "gmp@4"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# SDK for Groovy: a Java-based scripting language
brew "groovysdk"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Improved colored diff
brew "icdiff"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Integer Set Library for the polyhedral model
brew "isl@0.11"
# Integer Set Library for the polyhedral model
brew "isl@0.12"
# Agile dependency manager
brew "ivy"
# Library for creating multi-platform software
brew "s-lang"
# Powerful editor for programmers
brew "jed"
# Generate, develop and deploy Spring Boot + Angular/React applications
brew "jhipster"
# Featureful UNIX password cracker
brew "john"
# Note taking and to-do application with synchronisation capabilities
brew "joplin", link: false
# Lightweight and flexible command-line JSON processor
brew "jq"
# Python implementation written in Java (successor to JPython)
brew "jython"
# LastPass command-line interface tool
brew "lastpass-cli"
# Build tool for Clojure
brew "leiningen"
# Implementation of the file(1) command
brew "libmagic"
# Portable sound library
brew "libmikmod"
# C library for high precision complex numbers
brew "libmpc@0.8"
# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# C implementation of a Sass compiler
brew "libsass"
# Python generator for the console
brew "lorem"
# MPEG audio decoder
brew "mad"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Recursively compute digests on files/directories
brew "md5deep"
# Hash utilities
brew "md5sha1sum", link: false
# Scalable distributed version control system
brew "mercurial"
# Modern and intuitive terminal-based text editor
brew "micro"
# MIT/GNU Scheme development tools and runtime library
brew "mit-scheme"
# Project documentation with Markdown
brew "mkdocs"
# Remote terminal application
brew "mosh"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Open source relational database management system
brew "mysql", restart_service: true
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Network authentication cracking tool
brew "ncrack"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# General purpose programming language in the ML family
brew "ocaml"
# Generic build tool for OCaml
brew "ocamlbuild"
# SGML parser
brew "open-sp"
# OpenShift command-line interface tools
brew "openshift-cli"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Parallel bzip2
brew "pbzip2"
# Simplistic interactive filtering tool
brew "peco"
# Manage compile and link flags for libraries
brew "pkg-config"
# Draw UML diagrams
brew "plantuml"
# Password generator
brew "pwgen"
# x86 and PowerPC Emulator
brew "qemu"
# File browser
brew "ranger"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Convert character set (charsets)
brew "recode"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Repository tool for Android development
brew "repo"
# Fast, efficient and secure backup program
brew "restic"
# Utility for computing and verifying hash sums of files
brew "rhash"
# JavaScript engine
brew "rhino"
# The Rust toolchain installer
brew "rustup-init"
# Wrapper around libsass that helps to create command-line apps
brew "sassc"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Graphic adventure game interpreter
brew "scummvm"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Count lines of code in many languages
brew "sloccount"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# This is sSMTP, a program that replaces sendmail on workstations that should send their mail via the departmental mailhub from which they pick up their mail (via pop, imap, rsmtp, pop_fetch, NFS... or the like).
brew "ssmtp"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# Generate scripting interfaces to C/C++ code
brew "swig"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Bash completion for Vagrant
brew "vagrant-completion"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Bundler for JavaScript and friends
brew "webpack"
# Internet file retriever
brew "wget"
# ISO9660+RR manipulation tool
brew "xorriso"
# JavaScript package manager
brew "yarn"
# In-depth Attack Surface Mapping and Asset Discovery
brew "caffix/amass/amass"
brew "go-gitea/gitea/gitea"
# A tool to install and interact with Jenkins X on your Kubernetes cluster.
brew "jenkins-x/jx/jx"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Mac App Store command-line interface
brew "mas-cli/tap/mas"
# modular DocBook DSSSL stylesheets
brew "petere/sgml/docbook-dsssl"
# Implementation of the DSSSL language
brew "petere/sgml/openjade"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
cask "android-sdk"
cask "asciidocfx"
cask "burp-suite"
cask "fastlane"
cask "freemind"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "joplin"
cask "mactex"
cask "mattermost"
cask "metasploit"
cask "owasp-zap"
cask "podman"
cask "powershell"
cask "send-to-kindle"
cask "skype"
cask "skype-for-business"
cask "vagrant"
cask "vagrant-manager"
cask "vlc"
cask "vscodium"
cask "wireshark"
mas "EasyFind", id: 411673888
mas "iMovie", id: 408981434
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Marked", id: 448925439
mas "MeisterTask", id: 1051767777
mas "MindNode Lite", id: 402397683
mas "OneDrive", id: 823766827
mas "Outbank", id: 1094255754
mas "Trello", id: 1278508951
mas "uBlock", id: 1385985095
mas "Xcode", id: 497799835
