tap "akirakyle/qemu-virgl"
tap "derailed/k9s"
tap "filippo.io/age", "https://filippo.io/age"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homeport/tap"
tap "jenkins-x/jx"
tap "jesseduffield/lazygit"
tap "mas-cli/tap"
tap "norwoodj/tap"
tap "owasp-amass/amass"
tap "petere/sgml"
tap "remotemobprogramming/brew"
tap "robotsandpencils/made"
tap "rusty-ferris-club/tap"
tap "snyk/tap"
tap "theseal/ssh-askpass"
tap "trufflesecurity/trufflehog"
tap "wagoodman/dive"
tap "weaveworks/tap"
tap "weltraumschaf/tap"
# Portable ASCII art graphics library
brew "aalib"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# In-depth attack surface mapping and asset discovery
brew "amass"
# Asynchronous DNS library
brew "c-ares"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Angular
brew "angular-cli"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Java build tool
brew "ant"
# ANother Tool for Language Recognition
brew "antlr"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Download with resuming and segmented downloading
brew "aria2"
# C library for creating IP packets
brew "libnet"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Standard XML representation system for technical documents
brew "docbook"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Fast, efficient and secure backup program
brew "restic"
# High level CLI utility for restic
brew "autorestic"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Swiss Army Knife for OSGi bundles
brew "bnd"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Object-file caching compiler wrapper
brew "ccache"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Linter/analyzer for Makefiles
brew "checkmake"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Asynchronous event library
brew "libevent"
# C string library for manipulating Unicode strings
brew "libunistring"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for USB device access
brew "libusb"
# Generic machine emulator and virtualizer
brew "qemu"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: true
# Color-highlighted diff(1) output
brew "colordiff"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Securely send things from one computer to another
brew "croc"
# Converts boring normal dates to fun Discordian Date
brew "ddate"
# OWASP dependency-check
brew "dependency-check"
# Ncurses based advanced hex editor featuring diff mode and more
brew "dhex"
# Passphrases to remember
brew "diceware"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Passive DNS network mapper (a.k.a. subdomains bruteforcer)
brew "dnsmap"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line DNS Client for Humans
brew "doggo"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Charset analyzer and converter
brew "enca"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Test various flash cards
brew "f3"
# ISO AAC audio decoder
brew "faad2"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Open video compression format
brew "theora"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast web fuzzer written in Go
brew "ffuf"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Apt for fonts, the missing font manager for macOS/linux
brew "fnt"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# Bidirectional operation between a Subversion repository and Git
brew "git-svn"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Manage your GnuPG keys with ease!
brew "gpg-tui"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Kubernetes package manager
brew "helm"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Advanced HTML-to-text converter
brew "html2text"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Fast and multi-purpose HTTP toolkit
brew "httpx"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Converts many CD-ROM image formats to ISO9660
brew "iat"
# Improved colored diff
brew "icdiff"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Agile dependency manager
brew "ivy"
# Library for creating multi-platform software
brew "s-lang"
# Powerful editor for programmers
brew "jed"
# Extendable open source continuous integration server
brew "jenkins"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Python implementation written in Java (successor to JPython)
brew "jython"
# Run local Kubernetes cluster in Docker
brew "kind"
# Package manager for kubectl plugins
brew "krew"
# Lazier way to manage everything docker
brew "lazydocker"
# Build tool for Clojure
brew "leiningen"
# Input filter for the pager less
brew "lesspipe"
# Portable Foreign Function Interface library
brew "libffi"
# Implementation of the file(1) command
brew "libmagic"
# Portable sound library
brew "libmikmod"
# Library to decode mpeg-2 and mpeg-1 video streams
brew "libmpeg2"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# C implementation of a Sass compiler
brew "libsass"
# Library for database change tracking
brew "liquibase"
# Python generator for the console
brew "lorem"
# MPEG audio decoder
brew "mad"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Recursively compute digests on files/directories
brew "md5deep"
# Scalable distributed version control system
brew "mercurial"
# Modern and intuitive terminal-based text editor
brew "micro"
# Run a Kubernetes cluster locally
brew "minikube"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Fast port scanner
brew "naabu"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Text interface for Git repositories
brew "tig"
# Command-line and local web note-taking, bookmarking, and archiving
brew "nb"
# NCurses Disk Usage
brew "ncdu"
# Network authentication cracking tool
brew "ncrack"
# Libraries for security-enabled client and server applications
brew "nss"
# HTTP/DNS scanner configurable via YAML templates
brew "nuclei"
# Manage multiple Node.js versions
brew "nvm"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# General purpose programming language in the ML family
brew "ocaml"
# Generic build tool for OCaml
brew "ocamlbuild"
# SGML parser
brew "open-sp"
# OpenShift command-line interface tools
brew "openshift-cli"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Vulnerability scanner which uses the OSV database
brew "osv-scanner"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Parallel bzip2
brew "pbzip2"
# Perl compatible regular expressions library
brew "pcre"
# Simplistic interactive filtering tool
brew "peco"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Manage compile and link flags for libraries
brew "pkg-config"
# Draw UML diagrams
brew "plantuml"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Convert character set (charsets)
brew "recode"
# Web Reconnaissance Framework
brew "recon-ng"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility for computing and verifying hash sums of files
brew "rhash"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup"
# Wrapper around libsass that helps to create command-line apps
brew "sassc"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Count lines of code in many languages
brew "sloccount"
# SMART hard drive monitoring
brew "smartmontools"
# S/MIME signing utility for use with Git
brew "smimesign"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Editor of encrypted files
brew "sops"
# SQLite extension providing 256-bit AES encryption
brew "sqlcipher"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# SSH server & client auditing
brew "ssh-audit"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Subdomain discovery tool
brew "subfinder"
# Generate scripting interfaces to C/C++ code
brew "swig"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Linter for Terraform files
brew "tflint"
# High-performance, platform-neutral implementation of VNC
brew "tiger-vnc"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Language for application scale JavaScript development
brew "typescript"
# Simple GTD-style task management for the command-line
brew "ultralist"
# This UML tool aimed at providing a fast way of creating UML diagrams
brew "umlet"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# ISO9660+RR manipulation tool
brew "xorriso"
# JavaScript package manager
brew "yarn"
# CLI to convert between YAML, TOML, JSON and HCL
brew "yj"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew "homeport/tap/dyff"
# Mac App Store command-line interface
brew "mas-cli/tap/mas"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Modular DocBook DSSSL stylesheets
brew "petere/sgml/docbook-dsssl"
# Implementation of the DSSSL language
brew "petere/sgml/openjade"
# Swift handover for remote mobs using git. mob is a CLI tool written in GO. It keeps your master branch clean and creates WIP commits on mob-session branch.
brew "remotemobprogramming/brew/mob"
# Install and switch between multiple versions of Xcode
brew "robotsandpencils/made/xcodes"
# Secure shell history commands
brew "rusty-ferris-club/tap/shellclear"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
# Passphrase dialog for use with OpenSSH in macOS
brew "theseal/ssh-askpass/ssh-askpass"
# Find credentials all over the place
brew "trufflesecurity/trufflehog/trufflehog"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"
# Sshpass is a tool for non-interactivly performing password authentication with SSH's so called 
# "interactive keyboard password authentication". Most user should use SSH's more secure public 
# key authentiaction instead.
brew "weltraumschaf/tap/sshpass"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Instant messaging application
cask "adium"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Web security testing toolkit
cask "burp-suite"
# Calendar software focusing on flexibility and reliability
cask "busycal"
# Clipboard extension app
cask "clipy"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Tool to enable and disable hidden functions of Finder and other apps
cask "deeper"
# Trains AIs to understand and translate texts
cask "deepl"
# Digital photo manager
cask "digikam"
# Voice and text chat software
cask "discord"
# Emulator for x86 with DOS
cask "dosbox"
# Online diagram software
cask "drawio"
# Finds duplicate files in a computer system
cask "dupeguru"
# Find files, folders, or contents in any file
cask "easyfind"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# GIT client
cask "fork"
# 3D parametric modeller
cask "freecad"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Teach object orientation with Java
cask "greenfoot"
# Open-source video transcoder
cask "handbrake"
cask "haroopad"
# Hex editor focussing on speed
cask "hex-fiend"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Secure video conferencing app
cask "jitsi-meet"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# GUI replacement for the Java command-line utilities keytool and jarsigner
cask "keystore-explorer"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Free and open-source painting and sketching program
cask "krita"
# Open source code editor written in Rust
cask "lapce"
# Create, manage and debug system and user services
cask "launchcontrol"
# Official client for LBRY, a decentralised file-sharing and payment network
cask "lbry"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Host-based application firewall
cask "little-snitch"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source Markdown editor
cask "macdown"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Operating system maintenance and cleaning utility
cask "maintenance"
# Open source intelligence and graphical link analysis tool
cask "maltego"
# Markdown editor
cask "mark-text"
# Manages online multimedia libs of German, Austrian and Swiss public broadcasters
cask "mediathekview"
# Penetration testing framework
cask "metasploit"
# Online collaborative whiteboard platform
cask "miro"
# German banking and financial management software
cask "moneymoney"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Launcher utility to run multiple versions of Firefox side-by-side
cask "multifirefox"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Development environment, tooling platform and application framework
cask "netbeans"
# Free and open-source RSS reader
cask "netnewswire"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama"
# Cloud storage client
cask "onedrive"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# ZFS driver and utilities
cask "openzfs"
# Markdown editor with pandoc integration and paginated preview
cask "panwriter"
# Translation editor
cask "poedit"
# Calculate the overall performance of an investment portfolio
cask "portfolioperformance"
# Command-line shell and scripting language
cask "powershell"
# Trash, backup, lock and restore video editor preferences
cask "preference-manager"
# Flexible software sketchbook and a language for learning how to code
cask "processing"
# Microsoft Project in your browser
cask "projectlibre"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Image viewer
cask "qview"
# Protect your personal files
cask "ransomwhere"
# Archive manager for data compression and backups
cask "rar"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Scans, detects, and monitors keyboard taps
cask "reikey"
# Run classic graphical adventure and role-playing games
cask "scummvm"
# Manage SSH tunnels
cask "secure-pipes"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Instant messaging application focusing on security
cask "signal"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
# Code-based music creation and performance tool
cask "sonic-pi"
# Create, edit, browse SQLite databases
cask "sqlitestudio"
# Application for inspecting installer packages
cask "suspicious-package"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Remote access and connectivity software focused on security
cask "teamviewer"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# LaTeX editor
cask "texifier"
# General-purpose text editor
cask "textmate"
# Unpacks archive files
cask "the-unarchiver"
# Python IDE for beginners
cask "thonny"
# End-to-end encrypted instant messaging application
cask "threema"
# End-to-end encrypted instant messaging application
cask "threema@beta"
# Customizable email client
cask "thunderbird"
# Flexible level editor
cask "tiled"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Configurable document editor that supports Markdown
cask "typora"
# Virtual machines UI using QEMU
cask "utm"
# Virtualizer for x86 and arm64 hardware
cask "virtualbox@beta"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Network protocol analyzer
cask "wireshark"
# X Certificate and Key management
cask "xca"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Free and open source web app scanner
cask "zap"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
# Open-source markdown editor
cask "zettlr"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Annotate", id: 918207447
mas "Apple Configurator", id: 1037126344
mas "Caffeinated", id: 1362171212
mas "Camera Window", id: 6444870729
mas "Cuppa", id: 1297865739
mas "GarageBand", id: 682658836
mas "Ice Cubes", id: 6444915884
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Marked", id: 448925439
mas "MindNode", id: 1289197285
mas "MindNode Lite", id: 402397683
mas "MultiMarkdown Composer", id: 1275176220
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Shareful", id: 1522267256
mas "SimpleMind", id: 439654198
mas "Trello", id: 1278508951
mas "VMware Remote Console", id: 1230249825
vscode "1tontech.angular-material"
vscode "alefragnani.project-manager"
vscode "alexiv.vscode-angular2-files"
vscode "angular.ng-template"
vscode "asciidoctor.asciidoctor-vscode"
vscode "batisteo.vscode-django"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cyrilletuzi.angular-schematics"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "gregorbiswanger.json2ts"
vscode "humao.rest-client"
vscode "infinity1207.angular2-switcher"
vscode "ionide.ionide-fsharp"
vscode "jakebecker.elixir-ls"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jebbs.plantuml"
vscode "john-crowson.angular-file-changer"
vscode "johnpapa.angular2"
vscode "judge2020.duckyscript"
vscode "kevinrose.vsc-python-indent"
vscode "loiane.angular-extension-pack"
vscode "loiane.ts-extension-pack"
vscode "mads-hartmann.bash-ide-vscode"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "njpwerner.autodocstring"
vscode "obenjiro.arrr"
vscode "platformio.platformio-ide"
vscode "pmneo.tsimporter"
vscode "pomdtr.excalidraw-editor"
vscode "pranayagarwal.vscode-hack"
vscode "quarto.quarto"
vscode "quicktype.quicktype"
vscode "rbbit.typescript-hero"
vscode "rctay.karma-problem-matcher"
vscode "redhat.java"
vscode "rubymaniac.vscode-direnv"
vscode "rust-lang.rust-analyzer"
vscode "segerdekort.angular-cli"
vscode "shopify.ruby-lsp"
vscode "simontest.simontest"
vscode "steoates.autoimport"
vscode "stringham.move-ts"
vscode "sumneko.lua"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "tenninebt.vscode-koverage"
vscode "timonwong.shellcheck"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "ziyasal.vscode-open-in-github"
