tap "akirakyle/qemu-virgl"
tap "filippo.io/age", "https://filippo.io/age"
tap "jenkins-x/jx"
tap "petere/sgml"
tap "rusty-ferris-club/tap"
tap "snyk/tap"
tap "theseal/ssh-askpass"
tap "updatecli/updatecli"
tap "weltraumschaf/tap"
tap "xcodesorg/made"
# Simple, modern, secure file encryption
brew "age"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# Color-highlighted diff(1) output
brew "colordiff"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Passive DNS network mapper (a.k.a. subdomains bruteforcer)
brew "dnsmap"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Command-line DNS Client for Humans
brew "doggo"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Diff tool for YAML files, and sometimes JSON
brew "dyff"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Zip password cracker
brew "fcrackzip"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Version control system designed to be a better CVS
brew "subversion"
# Bidirectional operation between a Subversion repository and Git
brew "git-svn"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# HTTP/DNS scanner configurable via YAML templates
brew "nuclei"
# Manage multiple Node.js versions
brew "nvm"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Parallel bzip2
brew "pbzip2"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SQLite extension providing 256-bit AES encryption
brew "sqlcipher"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# SSH server & client auditing
brew "ssh-audit"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Subdomain discovery tool
brew "subfinder"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Internet file retriever
brew "wget"
# CLI to convert between YAML, TOML, JSON and HCL
brew "yj"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Secure shell history commands
brew "rusty-ferris-club/tap/shellclear"
# Install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Web browser
cask "firefox"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Hex editor focussing on speed
cask "hex-fiend"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GUI replacement for the Java command-line utilities keytool and jarsigner
cask "keystore-explorer"
# Create, manage and debug system and user services
cask "launchcontrol"
# Penetration testing framework
cask "metasploit"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Trash, backup, lock and restore video editor preferences
cask "preference-manager"
# Archive manager for data compression and backups
cask "rar"
# Application for inspecting installer packages
cask "suspicious-package"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Remote access and connectivity software focused on security
cask "teamviewer"
# General-purpose text editor
cask "textmate"
# Unpacks archive files
cask "the-unarchiver"
# Customizable email client
cask "thunderbird"
# Web browser focusing on security
cask "tor-browser"
# Multimedia player
cask "vlc"
# Free and open source web app scanner
cask "zap"
# Multiplayer code editor
cask "zed"
