tap "akirakyle/qemu-virgl"
tap "filippo.io/age", "https://filippo.io/age"
tap "homebrew/core"
tap "jenkins-x/jx"
tap "petere/sgml"
tap "rusty-ferris-club/tap"
tap "snyk/tap"
tap "theseal/ssh-askpass"
tap "updatecli/updatecli"
tap "weltraumschaf/tap"
tap "wpscanteam/tap"
tap "xcodesorg/made"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# GNU multiple precision arithmetic library
brew "gmp"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU compiler collection
brew "gcc"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# AI pair programming in your terminal
brew "aider"
# Asynchronous DNS library
brew "c-ares"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Angular
brew "angular-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Java build tool
brew "ant"
# ANother Tool for Language Recognition
brew "antlr"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Download with resuming and segmented downloading
brew "aria2"
# C library for creating IP packets
brew "libnet"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Standard XML representation system for technical documents
brew "docbook"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Fast, efficient and secure backup program
brew "restic"
# High level CLI utility for restic
brew "autorestic"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Swiss Army Knife for OSGi bundles
brew "bnd"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Linter/analyzer for Makefiles
brew "checkmake"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Generic library support script
brew "libtool"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# OWASP dependency-check
brew "dependency-check"
# Ncurses based advanced hex editor featuring diff mode and more
brew "dhex"
# Passphrases to remember
brew "diceware"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Passive DNS network mapper (a.k.a. subdomains bruteforcer)
brew "dnsmap"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line DNS Client for Humans
brew "doggo"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# .NET Core
brew "dotnet"
# Diff tool for YAML files, and sometimes JSON
brew "dyff"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Charset analyzer and converter
brew "enca"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Test various flash cards
brew "f3"
# ISO AAC audio decoder
brew "faad2"
# Zip password cracker
brew "fcrackzip"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Asynchronous event library
brew "libevent"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Vorbis general audio compression codec
brew "libvorbis"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Open video compression format
brew "theora"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast web fuzzer written in Go
brew "ffuf"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Apt for fonts, the missing font manager for macOS/linux
brew "fnt"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Git extension for versioning large files
brew "git-lfs"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# Bidirectional operation between a Subversion repository and Git
brew "git-svn"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Library for USB device access
brew "libusb"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Fast linters runner for Go
brew "golangci-lint"
# Manage your GnuPG keys with ease!
brew "gpg-tui"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Kubernetes package manager
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Advanced HTML-to-text converter
brew "html2text"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Fast and multi-purpose HTTP toolkit
brew "httpx"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Converts many CD-ROM image formats to ISO9660
brew "iat"
# Improved colored diff
brew "icdiff"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool to capture still images from an iSight or other video source
brew "imagesnap"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Agile dependency manager
brew "ivy"
# Library for creating multi-platform software
brew "s-lang"
# Powerful editor for programmers
brew "jed"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Package manager for kubectl plugins
brew "krew"
# Lazier way to manage everything docker
brew "lazydocker"
# Build tool for Clojure
brew "leiningen"
# Input filter for the pager less
brew "lesspipe"
# Portable Foreign Function Interface library
brew "libffi"
# C implementation of a Sass compiler
brew "libsass"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Library for database change tracking
brew "liquibase"
# Python generator for the console
brew "lorem"
# MPEG audio decoder
brew "mad"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Recursively compute digests on files/directories
brew "md5deep"
# Scalable distributed version control system
brew "mercurial"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Tool for smooth Git handover in mob programming sessions
brew "mob"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Lightweight PDF and XPS viewer
brew "mupdf-tools"
# Fast port scanner
brew "naabu"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Network authentication cracking tool
brew "ncrack"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# HTTP/DNS scanner configurable via YAML templates
brew "nuclei"
# Manage multiple Node.js versions
brew "nvm"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# General purpose programming language in the ML family
brew "ocaml"
# Generic build tool for OCaml
brew "ocamlbuild"
# SGML parser
brew "open-sp"
# OpenShift command-line interface tools
brew "openshift-cli"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Vulnerability scanner which uses the OSV database
brew "osv-scanner"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Parallel bzip2
brew "pbzip2"
# Perl compatible regular expressions library
brew "pcre"
# Simplistic interactive filtering tool
brew "peco"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Python package management tool
brew "poetry"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Convert character set (charsets)
brew "recode"
# Web Reconnaissance Framework
brew "recon-ng"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility for computing and verifying hash sums of files
brew "rhash"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup"
# Wrapper around libsass that helps to create command-line apps
brew "sassc"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Security health metrics for Open Source
brew "scorecard"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Count lines of code in many languages
brew "sloccount"
# SMART hard drive monitoring
brew "smartmontools"
# S/MIME signing utility for use with Git
brew "smimesign"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Editor of encrypted files
brew "sops"
# SQLite extension providing 256-bit AES encryption
brew "sqlcipher"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# SSH server & client auditing
brew "ssh-audit"
# Test SSL/TLS enabled services to discover supported cipher suites
brew "sslscan"
# Cross-shell prompt for astronauts
brew "starship"
# Crypto and x509 Swiss-Army-Knife
brew "step"
# Subdomain discovery tool
brew "subfinder"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Linter for Terraform files
brew "tflint"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Upgrade all the things
brew "topgrade"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Find and verify credentials
brew "trufflehog"
# Language for application scale JavaScript development
brew "typescript"
# This UML tool aimed at providing a fast way of creating UML diagrams
brew "umlet"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# ISO9660+RR manipulation tool
brew "xorriso"
# JavaScript package manager
brew "yarn"
# CLI to convert between YAML, TOML, JSON and HCL
brew "yj"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Modular DocBook DSSSL stylesheets
brew "petere/sgml/docbook-dsssl"
# Implementation of the DSSSL language
brew "petere/sgml/openjade"
# Secure shell history commands
brew "rusty-ferris-club/tap/shellclear"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
# Passphrase dialog for use with OpenSSH in macOS
brew "theseal/ssh-askpass/ssh-askpass"
# A declarative update policy engine.
brew "updatecli/updatecli/updatecli"
# Sshpass is a tool for non-interactivly performing password authentication with SSH's so called 
# "interactive keyboard password authentication". Most user should use SSH's more secure public 
# key authentiaction instead.
brew "weltraumschaf/tap/sshpass"
# Black box WordPress vulnerability scanner
brew "wpscanteam/tap/wpscan"
# Install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Instant messaging application
cask "adium"
# Application launcher and productivity software
cask "alfred"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Application uninstaller
cask "appcleaner"
# Alternative GUI for Time Machine
cask "backuploupe"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Web security testing toolkit
cask "burp-suite"
# Calendar software focusing on flexibility and reliability
cask "busycal"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# UI for creating Windows installer ISO from UUPDump
cask "crystalfetch"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Tool to enable and disable hidden functions of Finder and other apps
cask "deeper"
# AI-powered translator
cask "deepl"
# Emulator for x86 with DOS
cask "dosbox"
# Developer platform
cask "dotnet-sdk"
# Online diagram software
cask "drawio"
# Find files, folders, or contents in any file
cask "easyfind"
# Matrix collaboration client
cask "element"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# GIT client
cask "fork"
# 3D parametric modeller
cask "freecad"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Teach object orientation with Java
cask "greenfoot"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake-app"
# Hex editor focussing on speed
cask "hex-fiend"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Secure video conferencing app
cask "jitsi-meet"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Menu bar manager
cask "jordanbaird-ice"
# Password manager app
cask "keepassxc"
# GUI replacement for the Java command-line utilities keytool and jarsigner
cask "keystore-explorer"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Free and open-source painting and sketching program
cask "krita"
# Open source code editor written in Rust
cask "lapce"
# Create, manage and debug system and user services
cask "launchcontrol"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Host-based application firewall
cask "little-snitch"
# Discover, download, and run local LLMs
cask "lm-studio"
# Clipboard manager
cask "maccy"
# Open-source Markdown editor
cask "macdown"
# Operating system maintenance and cleaning utility
cask "maintenance"
# Open source intelligence and graphical link analysis tool
cask "maltego"
# Penetration testing framework
cask "metasploit"
# Online collaborative whiteboard platform
cask "miro"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Run LLMs locally
cask "msty"
# Launcher utility to run multiple versions of Firefox side-by-side
cask "multifirefox"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Free and open-source RSS reader
cask "netnewswire"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# ZFS driver and utilities
cask "openzfs"
# Translation editor
cask "poedit"
# Trash, backup, lock and restore video editor preferences
cask "preference-manager"
# Protect your personal files
cask "ransomwhere"
# Archive manager for data compression and backups
cask "rar"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Scans, detects, and monitors keyboard taps
cask "reikey"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
# Create, edit, browse SQLite databases
cask "sqlitestudio"
# Application for inspecting installer packages
cask "suspicious-package"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Remote access and connectivity software focused on security
cask "teamviewer"
# LaTeX editor
cask "texifier"
# General-purpose text editor
cask "textmate"
# Unpacks archive files
cask "the-unarchiver"
# End-to-end encrypted instant messaging application
cask "threema@beta"
# Customizable email client
cask "thunderbird"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Development environment
cask "vagrant"
# Virtualiser for arm64 hardware
cask "virtualbox"
# Integrated development environment
cask "visual-studio"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# X Certificate and Key management
cask "xca"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Free and open source web app scanner
cask "zap"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Annotate", id: 918207447
mas "Bitwarden", id: 1352778147
mas "Caffeinated", id: 1362171212
mas "Camera Window", id: 6444870729
mas "Cuppa", id: 1297865739
mas "Draw Things", id: 6444050820
mas "GarageBand", id: 682658836
mas "Ice Cubes", id: 6444915884
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Marked", id: 448925439
mas "MindNode Lite", id: 402397683
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Pocket", id: 568494494
mas "Shareful", id: 1522267256
mas "SimpleMind", id: 439654198
mas "Trello", id: 1278508951
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
